<template>
    <div class="agreeFixed" v-if="show">
        <div class="iconfont goback" @click="$emit('handle-show-file')">&#xe61e;</div>
        <div class="agreeContentW">
            <h1 v-if="fileType == 0">
                《回购协议》
            </h1>
            <h1 v-else style="color: #FE8B30">
                《贵金属闲置回收协议》
            </h1>
            <div v-if="fileType == 0" class="agreeContent">
             本协议是本人与椰子分商城黄金兑换供应商深圳市金宇阳光文化发展有限公司之间就黄金回购服务等相关事宜所订立的契约与约定（以下简称“本协议”）。<br/>
              1、 回购产品仅针对深圳市金宇阳光文化发展有限公司在椰子分商城售卖的黄金制品。<br/>
              2、 为保障回购客户利益和流程的安全性，回购时间统一在工作日早10：00-11:30，13:30-16:00进行。<br/>
              3、 回购检测费统一按照标准3元/克，以当日上海黄金交易所实时金价价格计算。<br/>
              4、 若实物需要回购时，用户需将兑换凭证（成交确认单原件）、检测证书以及保证包装完整邮寄至指定地址（邮费自付），回购公司收到金条/金砂安排人员在摄像头底下拆包、检查完回购产品外包装、证书等相关物品后进行成色检测（确认产品印记、克重、票据真伪、鉴定黄金真伪、及纯度）。<br/>
              5、 如检测无误，将根据上海黄金交易所实时金价减去检测费后的价格，锁定金价，电话与用户本人确认无误后，回购公司将在回购当天算起1个工作日内将回购资金转入申请人填写的银行账户内。<br/>
              6、 如检测出现疑问，回购公司有权终止回购操作，以书面形式说明检测结果和终止理由，并将联系本人退回产品（邮费自付）。<br/>
              7、 为保障回购款及时安全到账，请保障填写银行账户信息无误。<br/>
              8、本人知悉：本服务条款是处理双方权利义务的约定，除非违反国家强制性法律，否则始终有效。在本人下订单的同时，表示本人明确知晓以上事实，并与深圳市金宇阳光文化发展有限公司达成协议并接受所有的服务条款，并且本人对本人在订单中提供的所有信息的正确、完整和真实性负责。<br/>
              9、本人确认：深圳市金宇阳光文化发展有限公司对本合约中有关免除或限制责任、深圳市金宇阳光文化发展有限公司单方面拥有某些权利、增加本人责任或限制本人权利的条款，均已向本人进行了提示和说明。<br/>
              10、一旦勾选，即视为本人已经完全了解并接受本协议的全部内容，本人已阅读回购条款，充分了解回购相关信息，将严格按条款内容回购贵金属产品，对本协议条款的含义和相应的法律后果已全部清楚并理解，愿意遵守其全部内容。同时本人声明填写的回购信息内容完全属实，并保证其内容的真实性。<br/>
              最终解释权归深圳市金宇阳光文化发展有限公司所有。<br/>
            </div>
            <div v-else class="agreeContent">
              <p class="indent">在线回收前请认真阅读并理解本协议内容，协议内容中以加粗方式显著标识的文字，请用户着重阅读、慎重考虑。</p>
              <p class="indent">本协议由贵金属产品在线回收的贵金属实际合法持有者（下称“甲方”）与东莞市皇悦珠宝有限公司”（下称“乙方”）、根据双方真实意思表示，就贵金属闲置回收等事宜所订立的契约与约定（以下简称“本协议”）具有合同效力。</p>
              <p class="indent">甲方一经点击“我已阅读并同意《贵金属闲置回收协议》”按键，即视为甲方已经完全了解并接受本协议的全部内容，本协议立即生效并成为对双方有约束力的法律文件。</p>
              <p>1、闲置回收产品仅针对黄金制品，其他贵金属产品后续根据政策开放回收。</p>
              <p class="text-bold">2、依据国家相关法律法规，乙方有权采取有效的方式对甲方的身份进行认证，并有权调整和追加身份认证的项目和方式，甲方同意配合上述行为。</p>
              <p>3、本业务折损包括提料费用、检测成本、资金占用成本、回收方让利、人工处理等综合费用，按黄金售价的1%收取，即黄金回收到帐金额=本笔兑换黄金克数×当日平台黄金价格×（1-1%）</p>
              <p>4、为保障客户利益和流程安全，每日9：00--23：00每小时处理一次，23：00--次日9：00延到次日逐笔处理。除非有特殊说明，否则本协议中所涉及的所有天数均为自然日。</p>
              <p>5、凭提货码进行回收，用户只需线上提交；黄金属贵金属交易，提交视同认可本交易，无法撤销或退回。</p>
              <p>6、兑换黄金实物后回收，用户需将兑换凭证（成交确认单原件）、检测证书以及保证包装完整邮寄至指定地址（邮费自付），收到金条/金砂的人员在摄像头的监控下拆包、对回收产品外包装、产品明细、外观、证书进行检验后，进行成色检测（确认产品印记、克重、票据真伪、鉴定黄金真伪、及纯度）。</p>
              <p>7、黄金实物检测无误，将锁定金价，电话与甲方本人确认无误后，乙方将在检测完成当天算起1个工作日内将回收资金转入甲方填写的银行账户内。如检测出现疑问，乙方有权终止回收操作，以书面形式说明检测结果和终止理由，联系甲方本人退回产品。（回收所涉及运输费及保险费由甲方承担）。</p>
              <p>8、为保障回收款及时安全到账，请保障填写银行账户信息无误。约定时间内未收到回款，有可能是您的银行帐户填写有误，请点击下方“联系我们”向我们反馈，乙方不承担延时处理责任。</p>
              <p>9、本人知悉：本服务条款是处理双方权利义务的约定，除非违反国家强制性法律，否则始终有效。在甲方下订单的同时，表示甲方明确知晓以上事实，并与乙方（东莞市皇悦珠宝有限公司）达成协议并接受所有的服务条款，并且本人对本人在订单中提供的所有信息的正确、完整和真实性负责。</p>
              <p class="text-bold">10、如因国家出台的相关法律法规及政策、行政机关原因导致不便于开展相关贵金属产品在线回收业务的，甲方同意并认可乙方有权随时采取暂停向甲方提供服务、终止合作等措施。</p>
              <p class="text-bold">11、甲方确认：甲方已阅读闲置回收条款，充分了解回收相关信息，将严格按条款内容回收贵金属产品，对本协议条款的含义和相应的法律后果已全部清楚并理解，愿意遵守其全部内容。同时甲方声明填写的回收信息内容完全属实，并保证其内容的真实性。乙方对本合约中有关免除或限制责任、乙方单方面拥有某些权利、增加甲方责任或限制本人权利的条款，均已向甲方进行了提示和说明。</p>
            </div>
        </div>
    </div>
</template>

<script>
export default {
    props: {
        show: {
            type: Boolean,
            default: false
        },
        fileType: {
           type: Number,
           default: 0
        }
    },
    data: () => ({

    }),
    methods: {
        goBack() {

        }
    },
    mounted() {
        console.log(this.show)
    }

}
</script>

<style lang="scss" scoped>
.agreeFixed {
    position: fixed;
    top: 0;
    z-index: 10;
    background: #fff;
    height: 100%;
}

.goback {
    height: 50px;
    line-height: 50px;
    margin-left: 15px;
}

h1 {
    text-align: center;
    font-size: 18px;
    color: #30ce84;
    line-height: 50px;
}

.agreeContentW {
    position: relative;
    overflow: scroll;
    height: 100%;
    margin: 0 20px;
    .agreeContent {
        font-size: 13px;
        line-height: 28px;
        padding-bottom: 150px;
        text-indent: 2em;
        .indent {
          text-indent: 2em;
        }
        .text-bold {
          font-weight: bold;
        }
    }
}
</style>
<style scoped>
@media screen and (min-width: 600px){
  .agreeFixed{
    max-width: 384px; /*no*/
    left: 50% !important;
    transform: translateX(-50%);
  }
}
</style>
