<template>
  <div class="help-center">
    <div class="title">
      温馨提示
    </div>
    <div class="header-img">
      <img src="@/common/images/help/1.png" alt="">
    </div>
    <div class="help-main">
      <p>一、椰子分是什么？</p>
      <p>椰子分是一种“获胜奖励积分”，人民币：椰子分=1：1价值，在合作游戏平台的各项赛事中获胜的用户，将得到椰子分作为奖励，获胜用户可在官方指定的兑换商城进行兑换，同时按海南自贸港优惠税率纳税，椰子分商城拥有话费充值、加油卡充值、黄金兑换、会员卡券、生活缴费、京东商品、海南特色等20多万种丰富的商品及服务。</p>
      <p class="sub-title">二、如何获取椰子分？</p>
      <p>参加合作的游戏平台线上、线下各项赛事及活动，进入奖励圈即可获得对应椰子分作为奖励，不可现金直接购买。</p>
      <p class="sub-title">三、税款缴纳：</p>
      <p>根据国家税务局有关条例，税率规则如下：</p>
      <img src="@/common/images/help/2.jpg" alt="">
      <p>※税务查询：登录国家税务总局海南省税务局网站http://www.hitax.gov.cn/，点击进入“海南省电子税务局”，注册账号（自然人）并登录，进入个人中心即可查询缴税记录。也可在椰子分商城个人中心查看交易记录中的税费记录。</p>
      <p class="sub-title">四、椰子分充值卡指南：</p>
      <p>1.领取及使用方法：用户在合作游戏平台各项赛事中获得椰子分奖励，关注微信服务号“椰子竞技积分”——“椰兑换商城”——“我的”——“卡密充值”，输入16位卡密，即可完成充值并兑换商品或服务。</p>
      <p>2.椰子分充值卡具有有效期，一般为自发放日起36个月，不记名不挂失不计息不兑现不可修改，请妥善保管卡密并及时充值，但已到账椰子分账户的余额长期有效不过期。</p>
      <p>3.椰子分充值卡由“海南自贸区椰云网络科技有限公司”（以下简称发行公司）发行，是可以并仅限在“椰子分商城”兑换商品或服务的单用途竞技积分充值卡，暂不能兑换其他平台中的商品或服务。</p>
      <p>4.椰子分充值卡为不记名卡。</p>
      <p>5.椰子分充值卡相关内容最终解释权归发行公司所有。</p>
      <p class="sub-title">五、椰子分商城兑换</p>
      <p>1.椰子分商城兑换尽可使用椰子分一次性全额兑换，不可使用椰子分+现金的形式兑换。</p>
      <p>2.椰子分商城的兑换将在3个工作日内发货。</p>
      <p>3.兑换过程中的实名认证是根据相关规定进行纳税申报使用。</p>
      <p>4.成功兑换商品或服务的用户，可在商城查看“我的椰子分”记录。（纳税申报将在次月20日前进行）</p>
      <p>5.椰子分可在“椰子竞技积分”平台的“兑换商城”兑换商品或服务，兑换的商品或服务自商家发货之日起，大部分兑换的商品支持7天无理由退换货服务（兑换的服务或生鲜易腐定制商品等不支持退换货，详情查看以下内容），特殊商品除外。客服电话0898-3130-5180。</p>
      <p>6.发生退货时支持部分自动退回椰子分余额，可以并仅限未超过7天无理由退货时限的商品或服务；特殊情况下的退款，已缴纳的税款将不予退还，请知晓。</p>
      <p class="sub-title">六、售后规则：</p>
      <p>1. 椰子分可在“椰子竞技积分”平台的“兑换商城”兑换商品或服务，兑换的商品或服务自商家发货之日起，保证商品完好的情况下，大部分商品（不含兑换的服务、生鲜、易腐、定制商品、食品）支持7天无理由退货服务，特殊商品除外。赠品需一并提交退货返回，如赠品丢失，则无法办理退货。且无理由退货商品往返运费需由用户自行承担。</p>
      <p>※完好标准：商品保持原有品质、功能、商品本身、配件、商标标识齐全，内外包装完好，附件齐全（包括泡沫、包装袋、包装箱），商品未安装使用，保证无划伤、无破损、无磨损等外观问题，保证无磕碰、无拆卸等人为痕迹。</p>
      <p>※以下商品因特殊性，不参加无理由退货：</p>
      <p>(1)个人定制类商品或服务；</p>
      <p>(2)鲜活易腐的商品；</p>
      <p>(3)在线下载或者您拆封的音像制品、计算机软件等数字化商品；</p>
      <p>(4)服装鞋帽类商品已洗涤的；</p>
      <p>(5)交付的报纸、期刊类商品；</p>
      <p>(6)虚拟类商品：酒店/门票/度假旅游/保险、彩票、电影/演出/体育赛事、网络游戏虚拟商品交易区类、充值/手机号/增值业务、电脑/服务器/游戏软件类(包括但不限于序列号、激活码、CDKEY等)；</p>
      <p>(7)代金券、团购本地生活类商品(备注不参加未消费退款的本地化生活服务类商品)、实体服务等服务类商品；</p>
      <p>(8)实物类商品：通讯合约机、艺术品及收藏品、奢侈品、美妆/个人洗护类商品、食品/饮料/酒水、奶粉/辅食/尿布/、望远镜/显微镜/夜视镜、隐形眼镜、贴身使用的成人婴儿衣物、钻石/黄金/手表/珠宝首饰及个人配饰类产品；</p>
      <p>(9)跨境直邮的商品；</p>
      <p>(10)商品页面或商品详情注明不支持无理由退货的商品；</p>
      <p>(11)其他根据商品性质不宜适用无理由退货的商品，包括但不限于：</p>
      <p>a.拆封后易影响人身安全或者生命健康的商品，或者拆封后易导致商品品质发生改变的商品；b.一经激活或者试用后价值贬损较大的商品；c.销售时已明示的临近保质期的商品、有瑕疵的商品；d.无法保证退回商品完好的商品；</p>
      <p>2.在您收到商品时，请务必检查是否存在因运输过程造成的损坏、漏液、破碎等外观损坏，或原装配件缺失等问题，如您发现以上情况，请选择拒收并可第一时间与客服联系。如因您个人或您授权的其他个人代签收的商品，视同您已在收货时确认商品完好。</p>
      <p>3.退货(包含有质量问题的商品）时，请务必将商品的内带附件、赠品（如有）、保修卡、说明书、发票、检测报告（针对需凭检测报告办理退换货的商品）等随同商品一起退回，否则无法退货。建议产品外包装保留，退换货时附商品的原外包装。</p>
      <p>4.未经授权的维修、误用、碰撞、疏忽、滥用、进液、事故、改动、不正确的安装所造成的商品质量问题，或撕毁、涂改标贴、机器序号、防伪标记，不支持退换货。</p>
      <p>5. Apple品牌产品售后服务说明：</p>
      <p>已激活的iPhone不支持7天无理由退货，请您确认需求后再激活使用；为了维护您的权益，请在收到产品后仔细核对以下位置的商品序列号是否一致并拍照记录留存作为售后凭证，序列号存在的位置：1.包装盒背面、2.手机系统中、3.手机机身背面（部分型号）、4.卡托（部分型号）、5.保修凭证；</p>
      <p>如何找到iPhone序列号？https：//support.apple.com/zh-cn/HT204073</p>
      <p class="sub-title">七、欢迎咨询客服小椰子：</p>
      <p>电话：0898-3130-5180</p>
      <p>QQ：403292023</p>
      <p>微信：COCOGC2018</p>
      <p class="sub-title">八、商务合作：</p>
      <p>商务总监蔡大帅: 189 7628 3803（微信同号）</p>
      <p>运营总监崔贞实: 185 0023 3362（微信同号）</p>
      <p class="sub-title">九、责任声明：</p>
      <div>
        <img src="@/common/images/help/3.png" alt="">
      </div>
    </div>
  </div>
</template>
<style lang="scss" scoped>
.help-center {
  padding: 16px;
  background: #fff;
  .title {
    font-size: 24px;
    color: #444444;
  }
  .header-img{
      margin-top: 10px;
      width: 100%;
      height: 100%;
    }
  .help-main {
    margin-top: 10px;
    p {
      line-height: 26px;
      font-size: 16px;
      color: rgb(51, 51, 51);
    }
    .sub-title {
      margin-top: 20px;
      margin-bottom: 10px;
    }
  }
}
</style>
