<template>
    <div class="agreeFixed" v-if="show">
        <div class="iconfont goback" @click="$emit('handle-show-file')">&#xe61e;</div>
        <div class="agreeContentW">
            <h1>
                《黄金兑换协议》
            </h1>
            <div class="agreeContent">
            本协议是本人与椰子商城所有者海南自贸区椰云网络科技有限公司（以下简称“椰云网络”）之间就黄金兑换回购服务相关事宜所签订的契约与约定（以下简称“本协议”）<br/>
            1、服务条款的确认和接纳<br/>
            1.1 椰子分商城的各项电子服务归椰云网络所有。椰云网络是椰子分商城平台交易服务的网站经营者、支付结算服务的提供者。实际涉及具体产品及服务的，将由椰子分商城合作的产品及服务供应商提供。<br/>
            2、用户资料使用和存储限制<br/>
            2.1 在法律允许的范围内，椰云网络有判定本人的行为是否符合椰子分商城服务条款要求的权利，即当本人有违反情形时，椰云网络有权暂停本人在椰子分商城会员账号的使用。<br/>
            3、用户依法言行义务<br/>
            3.1 本协议依据国家相关法律法规制定，本人同意严格遵守以下条款：<br/>
            (1) 不利用椰子分商城从事非法活动；<br/>
            (2) 不干扰或混乱网络服务；<br/>
            (3) 遵守所有使用网络服务的网络协议、规定、程序和惯例。<br/>
            (4) 如果椰子分商城兑换过程中出现价格异常，兑换页面差错，多次兑换无需支付椰子分等情况，应该尽快向椰云网络客服反馈，使用商城漏洞或商品价格出错等异常获取利益属不正当行为，椰云网络有权追回并索赔。<br/>
            3.2 本人需对自己在网上的行为承担法律责任，本人若在椰子分商城上散布和传播反动、色情或其它违反国家法律的信息，椰子分商城的系统记录有可能作为本人违反法律的证据。若本人的行为违反法律法规规定以及社会公序良俗，椰云网络将有权暂停本人在椰子分商城会员账号的使用。<br/>
            4、黄金兑换<br/>
            4.1 椰子分商城黄金价格、数量、存货随商城供应商实际情况实时调整变动，由于互联网技术因素等客观原因存在，椰子分商城显示的信息可能会有一定的滞后性或差错。在商城系统出错或商品价格出错等异常的情况下产生的订单为无效订单，椰云网络有权协助做取消订单或退款、退货处理。<br/>
            4.2 椰云网络作为椰子分商城平台经营者，提供代付款服务，黄金回购由有资质的服务商提供，椰云网络不提供代付款业务以外的服务与担保。<br/>
            4.3 兑换过程中，本人一次性支付椰子分的方式兑换黄金，即同意椰云网络从本人椰子分余额中将兑换所需的椰子分全额一次性扣除。<br/>
            4.4 下订单后，即视为本人已认可兑换黄金方式、价格、数量、回购价格，填写的银行帐户信息准确无误，一旦兑换不可退货。<br/>
            4.5 已兑换的商品异常情况发生退货时，本人授权供应商直接将所退椰子分退回至本人名下的椰子分商城会员账户。兑换的商品，在支付成功后，如遇商品无库存，椰云网络有权为客户取消订单，全额退还本单椰子分。<br/>
            5、黄金售后处理<br/>
            5.1 每笔黄金兑换业务向上海黄金交易所提交真实购买交易，无法撤销；<br/>
            5.2 黄金回购下游服务商将在24小时内响应用户需求；<br/>
            5.3 如银行信息填写有误，请从商城“我的---联系我们”中与客服沟通，提交正确账户信息；<br/>
            5.4 如下情况造成订单延迟或无法到账，供应商不承担责任：<br/>
            (1) 本人提供的信息错误等原因导致；<br/>
            (2) 不可抗力因素导致，例如：自然灾害、交通戒严、突发战争等。<br/>
            5.5 商品的质量、到账服务由供应商提供，与椰云网络无关。如与供应商之间就订单商品的买卖、商品质量、送货及售后服务或其他相关事宜发生争议，本人将与供应商协商处理。如遇双方争议的情况，可以请椰云网络进行协凋。在争议处理过程中,本人继续按本条款及约定的规定向椰云网络支付兑换商品的椰子分。<br/>
            6、商城活动<br/>
            6.1 椰子分商城不定期开展商品团购、限购、抢购等活动,活动由供应商提供,椰云网络仅提供代付款服务,提供与活动商品相关的任何担保。相关商品约定参照本条款中关于商品的约定。<br/>
            6.2 相关活动规则以具体公告为准。<br/>
            7、其他<br/>
            7.1 本人知悉:本服务条款是处理双方权利义务的约定,除非违反国家强制性法律，否则始终有效。在本人下订单的同时，表示本人明确知晓以上事实，并与椰云网络达成协议并接受所有的服务条款,并且本人对本人在订单中提信息的正确、完整和真实性负责。<br/>
            7.2 本人确认:椰云网络对本合约中有关免除或限制椰云网络责任、椰云网络单方面拥有某些权利、增加本人责任或限制本人权利的条款,均已向本人进行了提示和说明。<br/>
            7.3 一旦勾选，即视为本人以完全了解并接受本协议的全部内容,本人已阅读协议条款,充分了解协议相关信息，将严格按照条款内容兑换商品或服务对本协议条款的含义和相应的法律后果已全部清楚并理解,愿意道守其全内容。同时本人声明填写的信息内容完全属实，并保证其内容的真实性。<br/>
            </div>
        </div>
    </div>
</template>

<script>
export default {
    props: {
        show: {
            type: Boolean,
            default: false
        }
    },
    data: () => ({

    }),
    methods: {
        goBack() {

        }
    },
    mounted() {
        console.log(this.show)
    }

}
</script>

<style lang="scss" scoped>
.agreeFixed {
    position: fixed;
    top: 0;
    z-index: 10;
    background: #fff;
    height: 100%;
}

.goback {
    height: 50px;
    line-height: 50px;
    margin-left: 15px;
}

h1 {
    text-align: center;
    font-size: 18px;
    color: #30ce84;
    line-height: 50px;
}

.agreeContentW {
    position: relative;
    overflow: scroll;
    height: 100%;
    margin: 0 20px;
    .agreeContent {
        font-size: 13px;
        line-height: 28px;
        padding-bottom: 150px;
        text-indent: 2em;
    }
}
</style>
<style scoped>
@media screen and (min-width: 600px){
  .agreeFixed{
    max-width: 384px; /*no*/
    left: 50% !important;
    transform: translateX(-50%);
  }
}
</style>
